#!/usr/bin/env bash
# gitea-start.sh
# Скрипт перезапуска сервиса Gitea

# Принудительно прерываем скрипт при ошибках, и неинициализированных переменных
set -euo pipefail


###########################
# Перезапуск сервиса Gitea
###########################

log "Перезапуск сервиса Gitea..."

# Проверка удачности запуска на уровне systemctl
systemctl start gitea || fail "systemctl не смог запустить сервис Gitea"


###############################################
# Проверка удачности перезапуска сервиса Gitea
###############################################

MAX_WAIT=30 # максимальное время ожидания
timer=0

# Проверка HTTP-ответа от Gitea
while ! curl -sf http://127.0.0.1:3000 >/dev/null; do

    sleep 1
    ((timer++)) || true
    if (( timer >= MAX_WAIT )); then
        fail "Сервис Gitea не ответил в течение $MAX_WAIT секунд"
    fi
done

log "Сервис Gitea успешно запущен ($timer сек.)"
