#!/usr/bin/env bash
# Скрипт ночного техобслуживания NAS

# принудительно прерываем скрипт при ошибках, и неинициализированных переменных
set -euo pipefail


# определяем абсолютный путь текущего скрипта
BASE_DIR="$(dirname "$(readlink -f "$0")")"

# читаем конфиг
source "$BASE_DIR/config.sh"


######################
# Определение функций
######################

# функция логгирования
log() {
    local msg="[$(date '+%F %T')] $*"
    echo "$msg" >> "$LOG_FILE"
    echo "$msg"
}


# функция прерывания сценария при отсутствии целевых директорий и файлов
fail_check() {
    log "ОШИБКА: $1"
    log "Сценарий резервного копирования Gitea прерван"
    exit 1
}


# функция обрезки лога
# (удаляются все строки, кроме последних $MAX_LOG_LINES)
trim_log() {
    if [[ -f "$LOG_FILE" ]]; then

        # создаём временный файл лога, с уникальным именем
        local tmp_file="${LOG_FILE}.tmp.$$"

        if tail -n "$MAX_LOG_LINES" "$LOG_FILE" > "$tmp_file"; then
            mv -f "$tmp_file" "$LOG_FILE"
        else
            rm -f "$tmp_file"
            log "ОШИБКА: Обрезка лога не удалась"

            # не прерываем скрипт через "exit 1",
            # так-как функция всё равно выполняется в самом конце
        fi
    fi
}


###############################################
# Проверка наличия целевых директорий и файлов
###############################################

[[ -f "$GITEA_BIN_FILE" ]]             || fail "ОШИБКА: Бинарный файл Gitea не найден: $GITEA_BIN_FILE"
[[ -f "$GITEA_CONFIG_FILE" ]]          || fail "ОШИБКА: Конфигурационный файл Gitea не найден: $GITEA_CONFIG_FILE"
[[ -f "$GITEA_DB_FILE" ]]              || fail "ОШИБКА: SQLite-база Gitea не найдена: $GITEA_DB_FILE"
[[ -d "$GITEA_GIT_DIR" ]]              || fail "ОШИБКА: Директория Git-репозиториев не найдена: $GITEA_GIT_DIR"
[[ -d "$GITEA_LFS_DIR" ]]              || fail "ОШИБКА: Директория LFS-хранилища не найдена: $GITEA_LFS_DIR"
[[ -d "$GITEA_LFS_BACKUP_DIR" ]]       || fail "ОШИБКА: Директория зеркала LFS-хранилища не найдена: $GITEA_LFS_BACKUP_DIR"


#######################
# Подключаем подмодули
#######################






# напоследок обрезаем лог
trim_log
