#!/usr/bin/env bash
# Скрипт ночного техобслуживания NAS

# принудительно прерываем скрипт при ошибках, и неинициализированных переменных
set -euo pipefail


# определяем абсолютный путь текущего скрипта
BASE_DIR="$(dirname "$(readlink -f "$0")")"

# читаем конфиг
source "$BASE_DIR/config.sh"

# принудительно создаём лог-директорию, чтобы отслеживать все ошибки
if ! mkdir -p "$LOG_DIR"; then
    echo "ERROR: Не удалось создать директорию: $LOG_DIR"
    exit 1
fi


######################
# Определение функций
######################

# функция логгирования
log() {
    local msg="[$(date '+%F %T')] $*"
    echo "$msg" >> "$LOG_FILE"
    echo "$msg"
}


# функция ошибки выполнения и прерывания скрипта
fail() {
    log "ERROR: $*"
    log "Прерван сценарий ночного техобслуживания NAS"
    exit 1
}


# функция обрезки лога
# (удаляются все строки, кроме последних $MAX_LOG_LINES)
trim_log() {
    if [[ -f "$LOG_FILE" ]]; then

        # создаём временный файл лога, с уникальным именем
        local tmp_file
        tmp_file=$(mktemp "${LOG_FILE}.tmp.XXXXXX") || fail "Не удалось создать временный log-файл для обрезки лога"

        # сохраняем последние $MAX_LOG_LINES строк
        if tail -n "$MAX_LOG_LINES" "$LOG_FILE" > "$tmp_file"; then

            # заменяем старый лог-файл на новый
            mv -f "$tmp_file" "$LOG_FILE" || fail "При обрезке лога не удалось заменить старый лог-файл обновлённым"
        else
            rm -f "$tmp_file"
            log "ERROR: Обрезка лога не удалась"

            # не прерываем скрипт через "fail()",
            # так-как функция всё равно выполняется в самом конце
        fi
    fi
}


##############################################
# Начало сценария ночного техобслуживания NAS
##############################################

log "Запущен сценарий ночного техобслуживания NAS"


# проверка, что сценарий запущен от root
if (( EUID != 0 )); then
    fail "Скрипт запущен не от root"
fi


###############################################
# Проверка наличия целевых директорий и файлов
###############################################

[[ -f "$GITEA_BIN_FILE" ]]             || fail "Бинарный файл Gitea не найден: $GITEA_BIN_FILE"
[[ -f "$GITEA_CONFIG_FILE" ]]          || fail "Конфигурационный файл Gitea не найден: $GITEA_CONFIG_FILE"
[[ -f "$GITEA_DB_FILE" ]]              || fail "SQLite-база Gitea не найдена: $GITEA_DB_FILE"
[[ -d "$GITEA_GIT_DIR" ]]              || fail "Директория Git-репозиториев не найдена: $GITEA_GIT_DIR"
[[ -d "$GITEA_LFS_DIR" ]]              || fail "Директория LFS-хранилища не найдена: $GITEA_LFS_DIR"
[[ -d "$GITEA_DUMP_DIR" ]]             || fail "Директория для дампов Gitea не найдена: $GITEA_DUMP_DIR"
[[ -d "$GITEA_LFS_BACKUP_DIR" ]]       || fail "Директория зеркала LFS-хранилища не найдена: $GITEA_LFS_BACKUP_DIR"


######################
# Останавливаем Gitea
######################

log "Остановка сервиса Gitea..."

# если сервис запущен - останавливаем его
if systemctl is-active --quiet gitea; then
    systemctl stop gitea
fi


# проверка остановки сервиса
MAX_WAIT=30 # максимальное время ожидания
timer=0
while systemctl is-active --quiet gitea; do
    sleep 1
    ((timer++))

    # проверяем: истекло-ли время ожидания?
    if (( timer >= MAX_WAIT )); then
        fail "Остановка сервиса Gitea не удалась"
    fi
done


# если gitea была остановлена до выполнения скрипта, то сообщаем об этом
if (( timer == 0 )); then
    log "Сервис Gitea был уже остановлен"
else
    log "Сервис Gitea успешно остановлен за ${timer} секунд"
fi


###########################################
# Этап резервного копирования данных Gitea
###########################################

source "$BASE_DIR/lib/gitea-backup.sh"


###################
# Перезапуск Gitea
###################

log "Перезапуск сервиса Gitea..."

# проверка удачности запуска на уровне systemctl
if ! systemctl start gitea; then
    fail "systemctl не смог запустить сервис Gitea"
fi


# проверка удачности запуска на уровне сервиса
timer=0
while ! systemctl is-active --quiet gitea; do
    sleep 1
    ((timer++))

    #проверяем: истекло-ли время ожидания?
    if (( timer >= MAX_WAIT )); then
        fail "Перезапуск сервиса Gitea не удался"
    fi
fi

log "Сервис Gitea успешно запущен за ${timer} секунд"



log "Сценарий ночного техобслуживания NAS успешно завершён"

# напоследок, обрезаем лог
trim_log
